<?php


function han_kaku_to_jen_kaku($str){
    $replace_of = array('ヴ','ガ','ギ','グ',
                        'ゲ','ゴ','ザ','ジ',
                        'ズ','ゼ','ゾ','ダ',
                        'ヂ','ヅ','デ','ド',
                        'バ','ビ','ブ','ベ',
                        'ボ','パ','ピ','プ','ペ','ポ');
    $replace_by = array('ｳﾞ','ｶﾞ','ｷﾞ','ｸﾞ',
                        'ｹﾞ','ｺﾞ','ｻﾞ','ｼﾞ',
                        'ｽﾞ','ｾﾞ','ｿﾞ','ﾀﾞ',
                        'ﾁﾞ','ﾂﾞ','ﾃﾞ','ﾄﾞ',
                        'ﾊﾞ','ﾋﾞ','ﾌﾞ','ﾍﾞ',
                        'ﾎﾞ','ﾊﾟ','ﾋﾟ','ﾌﾟ','ﾍﾟ','ﾎﾟ');
    $_result = str_replace($replace_of, $replace_by, $str);
    
    $replace_of = array('ア','イ','ウ','エ','オ',
                        'カ','キ','ク','ケ','コ',
                        'サ','シ','ス','セ','ソ',
                        'タ','チ','ツ','テ','ト',
                        'ナ','ニ','ヌ','ネ','ノ',
                        'ハ','ヒ','フ','ヘ','ホ',
                        'マ','ミ','ム','メ','モ',
                        'ヤ','ユ','ヨ','ラ','リ',
                        'ル','レ','ロ','ワ','ヲ',
                        'ン','ァ','ィ','ゥ','ェ',
                        'ォ','ヶ','ヶ','ャ','ュ',
                        'ョ','ッ','ー');        
    $replace_by = array('ｱ','ｲ','ｳ','ｴ','ｵ',
                        'ｶ','ｷ','ｸ','ｹ','ｺ',
                        'ｻ','ｼ','ｽ','ｾ','ｿ',
                        'ﾀ','ﾁ','ﾂ','ﾃ','ﾄ',
                        'ﾅ','ﾆ','ﾇ','ﾈ','ﾉ',
                        'ﾊ','ﾋ','ﾌ','ﾍ','ﾎ',
                        'ﾏ','ﾐ','ﾑ','ﾒ','ﾓ',
                        'ﾔ','ﾕ','ﾖ','ﾗ','ﾘ',
                        'ﾙ','ﾚ','ﾛ','ﾜ','ｦ',
                        'ﾝ','ｧ','ｨ','ｩ','ｪ',
                        'ｫ','ヵ','ヶ','ｬ','ｭ',
                        'ｮ','ｯ','ｰ');
    $_result = str_replace($replace_of, $replace_by, $_result);
    return $_result;
}



$filename = $argv[1];
$str = file_get_contents($filename);
$str = han_kaku_to_jen_kaku($str);
//$str = mb_convert_kana($str, 'rnks','utf8');

$fp = fopen($filename, "w");
@fwrite( $fp, $str, strlen($str) );
fclose($fp);

print "done " . $filename . "\n";
?>